-- 5. Выполнить задание 4, только теперь в дополнительном столбце должен указываться объем максимального заказа из тех, 
--    что уже были совершены на момент данного заказа (т.е. предыдущих), включая сам текущий заказ, 
--    но только среди заказов ЭТОГО ПРОДАВЦА. 
--    Заказы должны быть отсортированы сначала по номеру продавца, а затем уже по дате, номеру заказа.

SELECT 
    *,
    MAX(amt) OVER (PARTITION BY snum ORDER BY ord_date, onum ROWS UNBOUNDED PRECEDING) as max_amt_so_far_per_seller
FROM my_schema.ord
ORDER BY snum, ord_date, onum;
